xmltok/test.xml

<?xml version="1.0"?>
<s:Envelope
  xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
  s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<s:Body>
<u:GetConnectionTypeInfo
  xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1">
  foo bar
  baz
  
</u:GetConnectionTypeInfo>
</s:Body>
</s:Envelope>
